<center> <img src="res/ds3000.png"> </center>

<center> <h1> Week 6 - Day 2 </h1> </center>

<center> <h2> Part 2: Merging Dataframes </h2></center>

## Outline
1. <a href='#1'>Merging DataFrames</a>
2. <a href='#2'>Merge Types</a>
3. <a href='#3'>Merging on Index with Different Index Names</a>
4. <a href='#4'>Merging on Column with Different Column Names</a>

<a id="1"></a>

## 1. Merging DataFrames
* Can combine DataFrames, or datasets, by connecting rows based on one or more keys.

In [1]:
import pandas as pd

In [2]:
points = pd.read_csv("Day 2_res_hp_points.csv", index_col="Student")

In [3]:
points

                    Points
Student
Hermione Granger        50
Harry Potter            15
Ron Weasley             15
Ginny Weasley           20
Neville Longbottom      -5

In [6]:
quidditch = pd.read_csv("Day 2_res_hp_quidditch_team.csv", index_col = "Student")

In [7]:
quidditch

               Position  Score
Student
Harry Potter     Seeker    150
Katie Bell       Chaser     10
Demelza Robins   Chaser      0
Ginny Weasley    Chaser     40
Jimmy Peakes     Beater      0
Ritchie Coote    Beater     20
Ron Weasley      Keeper      0

https://www.youtube.com/watch?v=3vZL4eHdhRM

#### What if you want to combine the two dataframes?
* Note that not all students are quidditch players

### 1.1. merge() method
* Combines dataframes by linking rows using one or more keys

In [8]:
merged = pd.merge(points, quidditch, on="Student")

In [9]:
merged

               Points Position  Score
Student
Harry Potter       15   Seeker    150
Ron Weasley        15   Keeper      0
Ginny Weasley      20   Chaser     40

<a id="2"></a>

## 2. Merge types
* By default, merge does an **`inner`** join:
* Can specify the merge type using the **`how`** keyword argument:
> ```python
pd.merge(points, quidditch, on = "Student", how="inner")
```

### 2.1. inner merging
* Merges the columns from both DataFrames for rows that exist in both DataFrames only
* Returns the common set of rows, the intersection, found in both DataFrames

<center> <img src= "res/inner_join.png" width = "450px"/> </center>

In [10]:
#returns the house points, position and quidditch scores of the quidditch players only.
pd.merge(points, quidditch, on="Student", how="inner")

               Points Position  Score
Student
Harry Potter       15   Seeker    150
Ron Weasley        15   Keeper      0
Ginny Weasley      20   Chaser     40

### 2.2. outer merging
* Merges all columns from both DataFrames, regardless of whether the rows exists in one or both of the DataFrames
* Aka full merging

<center> <img src= "res/outer_join.png" width = "450px"/> </center>

In [11]:
#returns a list of all students from both dataset regardless of whether they are a Quidditch player
pd.merge(points, quidditch, on="Student", how = "outer")

                    Points Position  Score
Student
Hermione Granger      50.0      NaN    NaN
Harry Potter          15.0   Seeker  150.0
Ron Weasley           15.0   Keeper    0.0
Ginny Weasley         20.0   Chaser   40.0
Neville Longbottom    -5.0      NaN    NaN
Katie Bell             NaN   Chaser   10.0
Demelza Robins         NaN   Chaser    0.0
Jimmy Peakes           NaN   Beater    0.0
Ritchie Coote          NaN   Beater   20.0

### 2.3. left merging
* Merges all columns from DataFrame A and DataFrame B for rows that exist in DataFrame A

<center> <img src= "res/left_join.png" width = "450px"/> </center>

In [12]:
#returns the house points of the students in the first dataset, 
#as well as their quidditch game position and and score from the second dataset IF students are in the Quidditch team
pd.merge(points, quidditch, on="Student", how="left")

                    Points Position  Score
Student
Hermione Granger        50      NaN    NaN
Harry Potter            15   Seeker  150.0
Ron Weasley             15   Keeper    0.0
Ginny Weasley           20   Chaser   40.0
Neville Longbottom      -5      NaN    NaN

### 2.4 right merging
* Merges all columns from DataFrame A and DataFrame B for rows that exist in DataFrame B

<center> <img src= "res/right_join.png" width = "450px"/> </center>

In [13]:
#returns the quidditch players' position and and score from the second dataset
#as well as their house points IF players are in the first dataset
pd.merge(points, quidditch, on="Student", how="right")

                Points Position  Score
Student
Harry Potter      15.0   Seeker    150
Ron Weasley       15.0   Keeper      0
Ginny Weasley     20.0   Chaser     40
Katie Bell         NaN   Chaser     10
Demelza Robins     NaN   Chaser      0
Jimmy Peakes       NaN   Beater      0
Ritchie Coote      NaN   Beater     20

<a id="3"></a>

## 3. Merging on Index with Different Index Names
* Can merge on index if datasets use different names, or labels, for index columns.

In [14]:
points

                    Points
Student
Hermione Granger        50
Harry Potter            15
Ron Weasley             15
Ginny Weasley           20
Neville Longbottom      -5

In [15]:
quidditch

               Position  Score
Student
Harry Potter     Seeker    150
Katie Bell       Chaser     10
Demelza Robins   Chaser      0
Ginny Weasley    Chaser     40
Jimmy Peakes     Beater      0
Ritchie Coote    Beater     20
Ron Weasley      Keeper      0

In [16]:
#let's change the index name to "Name"
quidditch.index.names = ['Name']

In [17]:
quidditch

               Position  Score
Name
Harry Potter     Seeker    150
Katie Bell       Chaser     10
Demelza Robins   Chaser      0
Ginny Weasley    Chaser     40
Jimmy Peakes     Beater      0
Ritchie Coote    Beater     20
Ron Weasley      Keeper      0

In [21]:
#results in an error because no common columns
merged = pd.merge(points, quidditch)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

#### Merging on Index
* Set **left_index = True** and **right_index = True**
* This will enable the merge operation to use the indices of the DataFrame as the common columns

In [22]:
merged = pd.merge(points, quidditch, left_index = True, right_index = True)

In [23]:
merged

               Points Position  Score
Harry Potter       15   Seeker    150
Ron Weasley        15   Keeper      0
Ginny Weasley      20   Chaser     40

<a id="4"></a>

## 4. Merging on Column with Different Column Names
* Can merge dataframes based on columns, instead of indices

In [24]:
points.reset_index(inplace = True)

In [25]:
points

              Student  Points
0    Hermione Granger      50
1        Harry Potter      15
2         Ron Weasley      15
3       Ginny Weasley      20
4  Neville Longbottom      -5

In [26]:
quidditch

               Position  Score
Name
Harry Potter     Seeker    150
Katie Bell       Chaser     10
Demelza Robins   Chaser      0
Ginny Weasley    Chaser     40
Jimmy Peakes     Beater      0
Ritchie Coote    Beater     20
Ron Weasley      Keeper      0

In [27]:
merged = pd.merge(points, quidditch, left_on = "Student", right_index = True)

In [28]:
merged

         Student  Points Position  Score
1   Harry Potter      15   Seeker    150
2    Ron Weasley      15   Keeper      0
3  Ginny Weasley      20   Chaser     40

### Merging: Best Practices
* Merge on Index
* Make sure index names are identical before merging
    * Change index names using **df.index.names = ""**